{
  "solution": "\n\n<p><span class=\"indent\"></span>One day <span class=\"text_map\">Tsuruku Tazaki’s</span> four closest friends, the\nfriends he’d known for a long time, announced that they\ndid not want to see him, or talk with him, ever again.\nIt was a sudden, decisive declaration, with no room\nfor compromise. They gave no explanation, not a word,\nfor this harsh pronouncement.</p>\n\n<p><span class=\"indent\"></span>This drastic change took place during summer\n\tvacation of his sophomore year, between the first and\n\tsecond semesters. Afterward <span class=\"text_map\">Tsuruku Tazaki’s</span> life was\n\tchanged forever, as if a sheer ridge had divided\n\tthe original vegetation into two distinct biomes.</p>\n\n<p><span class=\"indent\"></span>“I’m sorry, but I have to ask you not to call any of us\nanymore,” <span class=\"text_blue\">Ao</span> said abruptly and without preface. No\n“Hey!” or “How’ve you been?” or “It’s been a while.” <em>I’m\nsorry</em> was his only concession to social niceties.</p>\n\n<p><span class=\"indent\"></span><span class=\"text_map\">Tsukuru</span> took a breath, and silently repeated <span class=\"text_blue\">Ao’s</span>\nwords, quickly assessing them. He tried to read the\nemotions behind them, but the words were like the\nformal recitation of an announcement. There had been\nno room for feelings.</p>\n\n<p><span class=\"indent\"></span>“If everybody’s telling me not to call them, then of\ncourse I won’t,” <span class=\"text_map\">Tsukuru</span> replied. The words slipped out,\nalmost automatically. He had tried to speak normally,\ncalmly, but his voice sounded like a stranger’s. The voice\nof someone living in a distant town, someone he had\nnever met (and probably never would).</p>\n\n<p><span class=\"indent\"></span>“Then don’t,” <span class=\"text_blue\">Ao</span> said.</p>\n\n<p><span class=\"indent\"></span>“I don’t plan on doing anything people don’t want me\nto do,” <span class=\"text_map\">Tsukuru</span> said.</p>\n\n<p><span class=\"indent\"></span><span class=\"text_blue\">Ao</span> let out a sound, neither a sigh nor a groan of agreement.</p>\n\n<p><span class=\"indent\"></span>“But if possible, I do want to know the reason for this,”\n<span class=\"text_map\">Tsukuru</span> said.</p>\n\n<p><span class=\"indent\"></span>“That’s not something I can tell you,” <span class=\"text_blue\">Ao</span> replied.</p>\n\n<p><span class=\"indent\"></span>“Then who can?”</p>\n\n<p><span class=\"indent\"></span>A thick stone wall rose. There was silence on the other\nend. <span class=\"text_map\">Tsukuru</span> could faintly hear <span class=\"text_blue\">Ao</span> breathing through\nhis nostrils. He pictured <span class=\"text_blue\">Ao’s</span> flat, fleshy nose.</p>\n\n<p><span class=\"indent\"></span>“Think about it, and you’ll figure it out,” <span class=\"text_blue\">Ao</span> said, finally.</p>\n\n<p><span class=\"indent\"></span><span class=\"text_map\">Tsukuru</span> was speechless. What was he talking about?\n<em>Think about it?</em> Think about <em>what</em>? If I think any harder\nabout anything, I won’t know who I am anymore.</p>\n\n<p><span class=\"indent\"></span>“It’s too bad it turned out like this,” <span class=\"text_blue\">Ao</span> said. “All of you\n\tfeel this way?”</p>\n\n<p><span class=\"indent\"></span>“Yeah. Everyone feels it’s too bad.”</p>\n\n<p><span class=\"indent\"></span>“Tell me—what happened?” <span class=\"text_map\">Tsukuru</span> asked.</p>\n\n<p><span class=\"indent\"></span>“You’d better ask yourself that,” <span class=\"text_blue\">Ao</span> said. <span class=\"text_map\">Tsukuru</span>\ndetected a quaver of sadness and anger in his voice, but\nit was just for an instant. Before <span class=\"text_map\">Tsukuru</span> could\nthink of how to respond, <span class=\"text_blue\">Ao</span> had hung up.</p>\n\t"
}
